STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/Sigfox/Sigfox_PushButton_DualCore/CM4/MbMux/sigfox_mbwrapper.c
/**
  ******************************************************************************
  * @file    sigfox_mbwrapper.c
  * @author  MCD Application Team
  * @brief   This file implements the CM4 side wrapper of the Sigfox interface
  *          shared between M0 and M4.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "platform.h"
#include "sigfox_mbwrapper.h"
#include "platform.h"
#include "mbmux.h"
#include "mbmuxif_sys.h"
#include "msg_id.h"
#include "mbmuxif_sigfox.h"
#include "stm32_mem.h"
#include "stm32_seq.h"
#include "sys_app.h"
#include "st_sigfox_api.h"
#include "sigfox_monarch_api.h"
#include "sgfx_app.h"
#include "sigfox_info.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* External variables ---------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
#ifndef MAX
#define MAX( a, b ) ( ( ( a ) > ( b ) ) ? ( a ) : ( b ) )
#endif /* MAX */
#define NB_ELEMENTS_MAX 3

/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UTIL_MEM_PLACE_IN_SECTION("MB_MEM1") uint8_t aSigfoxMbWrapShareBuffer[sizeof(sfx_rc_t)];

static sfx_u8(* app_cb)(sfx_u8 rc_bit_mask, sfx_s16 rssi);

static SigfoxCallback_t *callback_wrap;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Exported functions --------------------------------------------------------*/
/*!
  * \brief   Open Sigfox API
  *
  *
  * \param   [IN] sfx_rc_t - Radio configuration structure
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_OPEN_xx
  */
sfx_error_t SIGFOX_API_open(sfx_rc_t *rc)
{
  /* USER CODE BEGIN SIGFOX_API_open_1 */

  /* USER CODE END SIGFOX_API_open_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /* copy data from Cm4 stack memory to shared memory */
  UTIL_MEM_cpy_8((uint8_t *) aSigfoxMbWrapShareBuffer, (uint8_t *) rc, sizeof(sfx_rc_t));

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_START_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) aSigfoxMbWrapShareBuffer;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  /* copy back data from shared memory to Cm4 stack private memory */
  UTIL_MEM_cpy_8((uint8_t *) rc, (uint8_t *) aSigfoxMbWrapShareBuffer, sizeof(sfx_rc_t));

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_open_2 */

  /* USER CODE END SIGFOX_API_open_2 */
}

/*!
  * \brief   Close Sigfox API
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_CLOSE_xx
  */
sfx_error_t SIGFOX_API_close(void)
{
  /* USER CODE BEGIN SIGFOX_API_close_1 */

  /* USER CODE END SIGFOX_API_close_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t ret;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_STOP_ID;
  com_obj->ParamCnt = 0;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */
  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_close_2 */

  /* USER CODE END SIGFOX_API_close_2 */
}

/*!
  * \brief Send a standard SIGFOX frame with customer payload
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_SEND_FRAME_xx
  *          \ref SFX_ERR_INT_xx
  */
sfx_error_t SIGFOX_API_send_frame(sfx_u8 *customer_data, sfx_u8 customer_data_length,
                                  sfx_u8 *customer_response, sfx_u8 tx_mode,
                                  sfx_bool initiate_downlink_flag)
{
  /* USER CODE BEGIN SIGFOX_API_send_frame_1 */

  /* USER CODE END SIGFOX_API_send_frame_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /* copy data from Cm4 stack memory to shared memory */
  UTIL_MEM_cpy_8((uint8_t *) aSigfoxMbWrapShareBuffer, (uint8_t *) customer_data,
                 SGFX_MAX_UL_PAYLOAD_SIZE * sizeof(sfx_u8));
  UTIL_MEM_cpy_8((uint8_t *)(aSigfoxMbWrapShareBuffer + SGFX_MAX_UL_PAYLOAD_SIZE * sizeof(sfx_u8)),
                 (uint8_t *)customer_response, SGFX_MAX_DL_PAYLOAD_SIZE * sizeof(sfx_u8));

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_SEND_FRAME_DWNL_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) aSigfoxMbWrapShareBuffer;
  com_buffer[i++] = (uint32_t) customer_data_length;
  com_buffer[i++] = ((uint32_t) aSigfoxMbWrapShareBuffer + SGFX_MAX_UL_PAYLOAD_SIZE * sizeof(sfx_u8));
  com_buffer[i++] = (uint32_t) tx_mode;
  com_buffer[i++] = (uint32_t) initiate_downlink_flag ;

  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  /* copy back data from shared memory to Cm4 stack memory */
  UTIL_MEM_cpy_8((uint8_t *) customer_data, (uint8_t *) aSigfoxMbWrapShareBuffer,
                 SGFX_MAX_UL_PAYLOAD_SIZE * sizeof(sfx_u8));
  UTIL_MEM_cpy_8((uint8_t *)customer_response,
                 (uint8_t *)(aSigfoxMbWrapShareBuffer + SGFX_MAX_UL_PAYLOAD_SIZE * sizeof(sfx_u8)),
                 SGFX_MAX_DL_PAYLOAD_SIZE * sizeof(sfx_u8));

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_send_frame_2 */

  /* USER CODE END SIGFOX_API_send_frame_2 */
}

/*!
  * \brief Send a standard SIGFOX frame with customer payload
  *
  * \param[in] sfx_bool bit_value                Bit state (SFX_TRUE or SFX_FALSE)
  * \param[out] sfx_u8 *customer_response        Returned 8 Bytes data in case of downlink
  * \param[in] sfx_u8 tx_mode                    tx_mode shall be set to 2.
  * \param[in] sfx_bool initiate_downlink_flag   Flag to initiate a downlink response
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_SEND_BIT_xx
  *          \ref SFX_ERR_INT_xx
  */
sfx_error_t SIGFOX_API_send_bit(sfx_bool bit_value,
                                sfx_u8 *customer_response,
                                sfx_u8 tx_mode,
                                sfx_bool initiate_downlink_flag)
{
  /* USER CODE BEGIN SIGFOX_API_send_bit_1 */

  /* USER CODE END SIGFOX_API_send_bit_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /* copy data from Cm4 stack memory to shared memory */
  UTIL_MEM_cpy_8((uint8_t *)aSigfoxMbWrapShareBuffer, (uint8_t *)customer_response,
                 SGFX_MAX_DL_PAYLOAD_SIZE * sizeof(sfx_u8));

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_SEND_BIT_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) bit_value;
  com_buffer[i++] = (uint32_t) aSigfoxMbWrapShareBuffer;
  com_buffer[i++] = (uint32_t) tx_mode;
  com_buffer[i++] = (uint32_t) initiate_downlink_flag;

  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  /* copy back data from shared memory to Cm4 stack memory */
  UTIL_MEM_cpy_8((uint8_t *)customer_response, (uint8_t *) aSigfoxMbWrapShareBuffer,
                 SGFX_MAX_DL_PAYLOAD_SIZE * sizeof(sfx_u8));

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_send_bit_2 */

