STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/Sigfox/Sigfox_PushButton_DualCore/CM4/MbMux/sigfox_mbwrapper.c
  /* USER CODE END SIGFOX_API_send_bit_2 */
}

/*!
  * \brief   Send an out of band SIGFOX frame
  *
  *
  * \param   [IN] sfx_oob_enum_t oob_type  - Type of the OOB frame to send
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_INT_xx
  */
sfx_error_t SIGFOX_API_send_outofband(sfx_oob_enum_t oob_type)
{
  /* USER CODE BEGIN SIGFOX_API_send_outofband_1 */

  /* USER CODE END SIGFOX_API_send_outofband_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_SEND_OOB_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) oob_type;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_send_outofband_2 */

  /* USER CODE END SIGFOX_API_send_outofband_2 */
}

/*!
  * \brief   configure specific variables for standard
  *          It is mandatory to call this function after SIGFOX_API_open() for FH and LBT
  *
  * \param   [IN] config_words          -  Meaning depends on the standard
  * \param   [IN] sfx_bool timer_enable -  Enable timer feature for FH
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_SET_CONFIG_xx
  */
sfx_error_t SIGFOX_API_set_std_config(sfx_u32 config_words[NB_ELEMENTS_MAX],
                                      sfx_bool timer_enable)
{
  /* USER CODE BEGIN SIGFOX_API_set_std_config_1 */

  /* USER CODE END SIGFOX_API_set_std_config_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /* copy data from Cm4 stack memory to shared memory */
  UTIL_MEM_cpy_8((uint8_t *) aSigfoxMbWrapShareBuffer, (uint8_t *) config_words, NB_ELEMENTS_MAX * sizeof(sfx_u32));

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_SET_STD_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) aSigfoxMbWrapShareBuffer;
  com_buffer[i++] = (uint32_t) timer_enable;

  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  /* copy back data from shared memory to Cm4 stack private memory */
  UTIL_MEM_cpy_8((uint8_t *) config_words, (uint8_t *) aSigfoxMbWrapShareBuffer, NB_ELEMENTS_MAX * sizeof(sfx_u32));

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_set_std_config_2 */

  /* USER CODE END SIGFOX_API_set_std_config_2 */
}

/*!
  * \brief   Executes a continuous wave or modulation depending on the parameter type
  *
  * \param   [IN] frequency          -  Frequency at which the signal has to be generated
  * \param   [IN] sfx_modulation_type_t type   -  Type of modulation to use in continuous mode
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_START_CONTINUOUS_TRANSMISSION_xx
  */
sfx_error_t SIGFOX_API_start_continuous_transmission(sfx_u32 frequency, sfx_modulation_type_t type)
{
  /* USER CODE BEGIN SIGFOX_API_start_continuous_transmission_1 */

  /* USER CODE END SIGFOX_API_start_continuous_transmission_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /* copy data from Cm4 stack memory to shared memory */
  UTIL_MEM_cpy_8((uint8_t *) aSigfoxMbWrapShareBuffer, (uint8_t *) type, sizeof(sfx_modulation_type_t));

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_START_CONTINUOUS_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) frequency;
  com_buffer[i++] = (uint32_t) aSigfoxMbWrapShareBuffer;

  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  /* copy back data from shared memory to Cm4 stack private memory */
  UTIL_MEM_cpy_8((uint8_t *) type, (uint8_t *) aSigfoxMbWrapShareBuffer, sizeof(sfx_modulation_type_t));

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_start_continuous_transmission_2 */

  /* USER CODE END SIGFOX_API_start_continuous_transmission_2 */
}

/*!
  * \brief   Stop the current continuous transmission
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_STOP_CONTINUOUS_TRANSMISSION_xx
  */
sfx_error_t SIGFOX_API_stop_continuous_transmission(void)
{
  /* USER CODE BEGIN SIGFOX_API_stop_continuous_transmission_1 */

  /* USER CODE END SIGFOX_API_stop_continuous_transmission_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t ret;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_STOP_CONTINUOUS_ID;
  com_obj->ParamCnt = 0;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */
  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_stop_continuous_transmission_2 */

  /* USER CODE END SIGFOX_API_stop_continuous_transmission_2 */
}

/*!
  * \brief   Returns current SIGFOX library version, or RF Version, or MCU version
  *
  * \param[out] sfx_u8 **version                 Pointer to Byte array (ASCII format) containing library version
  * \param[out] sfx_u8 *size                     Size of the byte array pointed by *version
  * \param[in]  sfx_version_type_t type          Type of the version ( MCU, RF, ... )
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_GET_VERSION_xx
  */
sfx_error_t SIGFOX_API_get_version(sfx_u8 **version, sfx_u8 *size, sfx_version_type_t type)
{
  /* USER CODE BEGIN SIGFOX_API_get_version_1 */

  /* USER CODE END SIGFOX_API_get_version_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /* copy data from Cm4 stack memory to shared memory */
  UTIL_MEM_cpy_8((uint8_t *) aSigfoxMbWrapShareBuffer, (uint8_t *) version, sizeof(sfx_u32));
  UTIL_MEM_cpy_8((uint8_t *)(aSigfoxMbWrapShareBuffer + sizeof(sfx_u32)), (uint8_t *) size, sizeof(sfx_u8));

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_GET_VERSION_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) aSigfoxMbWrapShareBuffer;
  com_buffer[i++] = (uint32_t)(aSigfoxMbWrapShareBuffer + sizeof(sfx_u32));
  com_buffer[i++] = (uint32_t) type ;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  /* copy back data from shared memory to Cm4 stack private memory */
  UTIL_MEM_cpy_8((uint8_t *) version, (uint8_t *) aSigfoxMbWrapShareBuffer, sizeof(sfx_u32));
  UTIL_MEM_cpy_8((uint8_t *) size, (uint8_t *)(aSigfoxMbWrapShareBuffer + sizeof(sfx_u32)), sizeof(sfx_u8));

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_get_version_2 */

  /* USER CODE END SIGFOX_API_get_version_2 */
}

/*!
  * \brief   copies the ID of the device to the pointer given in parameter
  *
  *
  * \param[out] sfx_u8* dev_id    Pointer where to write the device ID
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_GET_DEVICE_ID_xx
  */
sfx_error_t SIGFOX_API_get_device_id(sfx_u8 *dev_id)
{
  /* USER CODE BEGIN SIGFOX_API_get_device_id_1 */

  /* USER CODE END SIGFOX_API_get_device_id_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /* copy data from Cm4 stack memory to shared memory */
  UTIL_MEM_cpy_8((uint8_t *) aSigfoxMbWrapShareBuffer, (uint8_t *) dev_id, sizeof(sfx_u32));

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_GET_DEVICE_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) aSigfoxMbWrapShareBuffer;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  /* copy back data from shared memory to Cm4 stack private memory */
  UTIL_MEM_cpy_8((uint8_t *) dev_id, (uint8_t *) aSigfoxMbWrapShareBuffer, sizeof(sfx_u32));

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_get_device_id_2 */

