STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/Sigfox/Sigfox_PushButton_DualCore/CM4/MbMux/sigfox_mbwrapper.c
  /* USER CODE END SIGFOX_API_get_device_id_2 */
}

/*!
  * \brief   Get the value of the PAC stored in the device
  *
  *
  * \param[out] sfx_u8* initial_pac              Pointer to initial PAC
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_GET_DEVICE_ID_xx
  */
sfx_error_t SIGFOX_API_get_initial_pac(sfx_u8 *initial_pac)
{
  /* USER CODE BEGIN SIGFOX_API_get_initial_pac_1 */

  /* USER CODE END SIGFOX_API_get_initial_pac_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /* copy data from Cm4 stack memory to shared memory */
  UTIL_MEM_cpy_8((uint8_t *) aSigfoxMbWrapShareBuffer, (uint8_t *) initial_pac, PAC_LENGTH * sizeof(sfx_u8));

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_GET_INIT_PAC_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) aSigfoxMbWrapShareBuffer;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  /* copy back data from shared memory to Cm4 stack private memory */
  UTIL_MEM_cpy_8((uint8_t *) initial_pac, (uint8_t *) aSigfoxMbWrapShareBuffer, PAC_LENGTH * sizeof(sfx_u8));

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_get_initial_pac_2 */

  /* USER CODE END SIGFOX_API_get_initial_pac_2 */
}

/*!
  * \brief   Set the period for transmission of RC Sync frame
  *
  *
  * \param[in] sfx_u16 rollover_counter_period
  *       Transmission period of the RC Sync frame (in number of 'normal' frames)
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_API_GET_DEVICE_ID_xx
  */
sfx_error_t SIGFOX_API_set_rc_sync_period(sfx_u16 rc_sync_period)
{
  /* USER CODE BEGIN SIGFOX_API_set_rc_sync_period_1 */

  /* USER CODE END SIGFOX_API_set_rc_sync_period_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_SET_RCSYNC_PERIOD_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) rc_sync_period;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_API_set_rc_sync_period_2 */

  /* USER CODE END SIGFOX_API_set_rc_sync_period_2 */
}

/*!
  * \brief   executes the test modes needed for the Sigfox RF and Protocol Tests
  *
  * \param[in]  sfx_rc_t                    Radio Configuration pointer
  * \param[in]  sfx_test_mode_t test_mode   Test mode to be executed
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  */
sfx_error_t ADDON_SIGFOX_RF_PROTOCOL_API_test_mode(sfx_rc_enum_t rc_enum, sfx_test_mode_t test_mode)
{
  /* USER CODE BEGIN ADDON_SIGFOX_RF_PROTOCOL_API_test_mode_1 */

  /* USER CODE END ADDON_SIGFOX_RF_PROTOCOL_API_test_mode_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_API_TEST_MODE_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) rc_enum;
  com_buffer[i++] = (uint32_t) test_mode;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN ADDON_SIGFOX_RF_PROTOCOL_API_test_mode_2 */

  /* USER CODE END ADDON_SIGFOX_RF_PROTOCOL_API_test_mode_2 */
}

/*!
  * \brief   executes the test modes needed for the Sigfox RF and Protocol Tests
  *
  * \param[in]  sfx_rc_t                    Radio Configuration pointer
  * \param[in]  sfx_test_mode_t test_mode   Test mode to be executed
  * \param[in]  sfx_u8 rc_capabilities      Radio Capabilities in bitmask format
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  */
sfx_error_t ADDON_SIGFOX_RF_PROTOCOL_API_monarch_test_mode(sfx_rc_enum_t rc_enum, sfx_test_mode_t test_mode,
                                                           sfx_u8 rc_capabilities)
{
  /* USER CODE BEGIN ADDON_SIGFOX_RF_PROTOCOL_API_monarch_test_mode_1 */

  /* USER CODE END ADDON_SIGFOX_RF_PROTOCOL_API_monarch_test_mode_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_API_MONARCH_TEST_MODE_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) rc_enum;
  com_buffer[i++] = (uint32_t) test_mode;
  com_buffer[i++] = (uint32_t) rc_capabilities;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN ADDON_SIGFOX_RF_PROTOCOL_API_monarch_test_mode_2 */

  /* USER CODE END ADDON_SIGFOX_RF_PROTOCOL_API_monarch_test_mode_2 */
}

/*!
  * \brief   executes a scan of the air to detect a Sigfox Beacon
  *
  * \param[in] sfx_u16 timer                     Scan duration value ( with the unit parameter information )
  * \param[in] sfx_timer_unit_enum_t  unit       Unit to be considered for the scan time computation
  * \param[in] app_callback_handler              This is the function that will be called by the Sigfox Library when the scan is completed.
  *                                              ( either when RC Found or when Timeout )
  *                 parameter of this callback are :
  *                     \param[out] sfx_u8       rc  Value of the RC found. There could be only 1 RC or 0 ( not found )
  *                     \param[out] rssi         RSSI value of the RC found. if rc = 0, rssi is not valid ( is set to 0 too )
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_MONARCH_API_xx
  */
sfx_error_t SIGFOX_MONARCH_API_execute_rc_scan(sfx_u8 rc_capabilities_bit_mask, sfx_u16 timer,
                                               sfx_timer_unit_enum_t unit, sfx_u8(* app_callback_handler)(sfx_u8 rc_bit_mask, sfx_s16 rssi))
{
  /* USER CODE BEGIN SIGFOX_MONARCH_API_execute_rc_scan_1 */

  /* USER CODE END SIGFOX_MONARCH_API_execute_rc_scan_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer ;
  uint16_t i = 0;
  uint32_t ret;

  /*Init callback on M4 side*/
  app_cb = app_callback_handler;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_API_MONARCH_TEST_EXEC_RC_SCAN_ID;
  com_buffer = com_obj->ParamBuf;
  com_buffer[i++] = (uint32_t) rc_capabilities_bit_mask;
  com_buffer[i++] = (uint32_t) timer;
  com_buffer[i++] = (uint32_t) unit;
  com_buffer[i++] = (uint32_t) app_cb;
  com_obj->ParamCnt = i;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */

  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_MONARCH_API_execute_rc_scan_2 */

