STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/Sigfox/Sigfox_PushButton_DualCore/CM4/MbMux/sigfox_mbwrapper.c
  /* USER CODE END SIGFOX_MONARCH_API_execute_rc_scan_2 */
}

/*!
  * \brief    stops a RC scan which is on going
  *
  * \retval  sfx_error_t Status of the operation. Possible returns are:
  *          \ref SFX_ERR_NONE,
  *          \ref SFX_ERR_MONARCH_API_xx
  */
sfx_error_t SIGFOX_MONARCH_API_stop_rc_scan(void)
{
  /* USER CODE BEGIN SIGFOX_MONARCH_API_stop_rc_scan_1 */

  /* USER CODE END SIGFOX_MONARCH_API_stop_rc_scan_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t ret;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_API_MONARCH_STOP_RC_SCAN_ID;
  com_obj->ParamCnt = 0;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */
  ret = com_obj->ReturnVal;
  return (sfx_error_t) ret;
  /* USER CODE BEGIN SIGFOX_MONARCH_API_stop_rc_scan_2 */

  /* USER CODE END SIGFOX_MONARCH_API_stop_rc_scan_2 */
}

/**
  * @brief initialises the SigfoxInfo capabilities table
  * @param none
  * @retval  none
  */
void SigfoxInfo_Init(void)
{
  /* USER CODE BEGIN SigfoxInfo_Init_1 */

  /* USER CODE END SigfoxInfo_Init_1 */
  MBMUX_ComParam_t *com_obj;

  com_obj = MBMUXIF_GetSigfoxFeatureCmdComPtr();
  com_obj->MsgId = SIGFOX_INFO_INIT_ID;
  com_obj->ParamCnt = 0;
  MBMUXIF_SigfoxSendCmd();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN SigfoxInfo_Init_2 */

  /* USER CODE END SigfoxInfo_Init_2 */
}

/**
  * @brief returns the pointer to the SigfoxInfo capabilities table
  * @param none
  * @retval  SigfoxInfoTable pointer
  */
SigfoxInfo_t *SigfoxInfo_GetPtr(void)
{
  /* USER CODE BEGIN SigfoxInfo_GetPtr_1 */

  /* USER CODE END SigfoxInfo_GetPtr_1 */
  FEAT_INFO_Param_t  *p_feature;

  p_feature = MBMUXIF_SystemGetFeatCapabInfoPtr(FEAT_INFO_SIGFOX_ID);
  return (SigfoxInfo_t *) p_feature->Feat_Info_Config_Ptr ;
  /* USER CODE BEGIN SigfoxInfo_GetPtr_2 */

  /* USER CODE END SigfoxInfo_GetPtr_2 */
}

void Sigfox_Register(SigfoxCallback_t *SigfoxCallback)
{
  /* USER CODE BEGIN Sigfox_Register_1 */

  /* USER CODE END Sigfox_Register_1 */
  callback_wrap = SigfoxCallback;
  /* USER CODE BEGIN Sigfox_Register_2 */

  /* USER CODE END Sigfox_Register_2 */
}
/**
  * @brief This function processes the callbacks and primitives from Cm0
  * @param ComObj : parameters
  * @retval none
  */

void Process_Sigfox_Notif(MBMUX_ComParam_t *ComObj)
{
  /* USER CODE BEGIN Process_Sigfox_Notif_1 */

  /* USER CODE END Process_Sigfox_Notif_1 */
  uint32_t    cb_ret;

  APP_LOG(TS_ON, VLEVEL_H, "CM4 - Sigfox Notif received \n\r");

  /* process Command */
  switch (ComObj->MsgId)
  {
    /* callbacks */
    case SIGFOX_GET_BATTERY_LEVEL_CB_ID:
      if (callback_wrap->GetBatteryLevel != NULL)
      {
        cb_ret = (uint32_t) callback_wrap->GetBatteryLevel();
      }
      else
      {
        while (1) {}
      }
      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal =  cb_ret; /* */
      break;

    case SIGFOX_GET_TEMPERATURE_LEVEL_CB_ID:
      if (callback_wrap->GetTemperatureLevel != NULL)
      {
        cb_ret = (uint32_t) callback_wrap->GetTemperatureLevel();
      }
      else
      {
        while (1) {}
      }
      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal =  cb_ret; /* */
      break;

    case SIGFOX_MONARCH_RC_SCAN_CB_ID:
      if (app_cb != NULL)
      {
        cb_ret = (sfx_u8) app_cb((sfx_u8)ComObj->ParamBuf[0], (sfx_s16) ComObj->ParamBuf[1]);
      }
      else
      {
        while (1) {}
      }
      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal =  cb_ret; /* */
      break;

    default:
      break;
  }

  /* send Ack */
  APP_LOG(TS_ON, VLEVEL_H,  "CM4 - Sigfox sending ack \n\r");
  MBMUX_AcknowledgeSnd(FEAT_INFO_SIGFOX_ID);
  /* USER CODE BEGIN Process_Sigfox_Notif_2 */

  /* USER CODE END Process_Sigfox_Notif_2 */
}

/* Private Functions Definition -----------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
